app/Controllers/AdminApprovalController.php

public function approveReset($id)
{
    // Mulai transaksi database
    $this->db->transStart();

    try {
        // 1. Dapatkan data permintaan reset
        $builder = $this->db->table('meter_reset_request');
        $request = $builder->where('id', $id)->get()->getRowArray();
---
SELECT *
FROM `meter_reset_request`
WHERE `meter_reset_request`.`id` = '1'

        }

        // 4. Update status permintaan
        $this->db->table('meter_reset_request')
            ->where('id', $id)
            ->update([
                'status' => 'approved',
                'approved_by' => session()->get('user_id'),
                'approved_at' => date('Y-m-d H:i:s')
            ]);
---
UPDATE `meter_reset_request` SET `status` = 'approved', `approved_by` = '1', `approved_at` = '2025-06-23 16:22:43'
WHERE `id` = '1'