app/Controllers/AdminApprovalController.php

    private function _getOperatorNames()
    {
        $operatorModel = new \App\Models\OperatorModel();
        $operators = $operatorModel->findAll();
---
SELECT *
FROM `operator`

public function approveReset($id)
{
    $db = \Config\Database::connect();
    $db->transStart();

    try {
        $request = $this->resetModel->find($id);
        if (!$request) {
            throw new \Exception("Permintaan reset tidak ditemukan");
        }

        // **Pisahkan logika berdasarkan reset_type**
        if ($request['reset_type'] === 'physical') {
            // **Hanya update nozzle, tidak ubah data penjualan**
            $this->nozzleModel->update($request['nozzle_id'], [
                'current_meter' => $request['meter_awal_baru'],
                'last_reset_at' => date('Y-m-d H:i:s')
            ]);
---
UPDATE `nozzle` SET `current_meter` = '0.00', `last_reset_at` = '2025-06-23 16:17:26'
WHERE `nozzle`.`id` IN ('1')