app/Controllers/Penerimaan.php

    public function index()
    {
        $role = session()->get('role');
        $kode_spbu = session()->get('kode_spbu');

        if ($role === 'admin_spbu') {
            $data['penerimaan'] = $this->penerimaanModel
                ->select('penerimaan.*, produk_bbm.nama_produk')
                ->join('produk_bbm', 'produk_bbm.kode_produk = penerimaan.kode_produk', 'left')
                ->where('penerimaan.kode_spbu', $kode_spbu)
                ->findAll();
---
SELECT `penerimaan`.*, `produk_bbm`.`nama_produk`
FROM `penerimaan`
LEFT JOIN `produk_bbm` ON `produk_bbm`.`kode_produk` = `penerimaan`.`kode_produk`
WHERE `penerimaan`.`kode_spbu` = 7490123

    public function create()
    {
        $kode_spbu = session()->get('kode_spbu');
        $role = session()->get('role');

        $data['title'] = 'Tambah Penerimaan BBM';
        $data['produkList'] = $this->produkModel->findAll();

        if ($role === 'admin_spbu') {
            $spbu = $this->spbuModel->where('kode_spbu', $kode_spbu)->first();
            $data['spbuList'] = [$spbu];
            $data['tangkiList'] = $this->tangkiModel->where('kode_spbu', $kode_spbu)->findAll();
---
SELECT *
FROM `spbu`
WHERE `kode_spbu` = 7490123
 LIMIT 1
SELECT *
FROM `tangki`
WHERE `kode_spbu` = 7490123

    public function store()
    {
        $role = session()->get('role');
        $kode_spbu = $this->request->getPost('kode_spbu');

        if ($role === 'admin_spbu') {
            $kode_spbu = session()->get('kode_spbu');
        }

        if (!hasAccessToSPBU($kode_spbu)) {
            return redirect()->to('/unauthorized');
        }

        $tangki = $this->tangkiModel->find($this->request->getPost('tangki_id'));
        $volume_do = floatval($this->request->getPost('volume_do'));

        $data = [
            'tanggal'          => $this->request->getPost('tanggal'),
            'kode_spbu'        => $kode_spbu,
            'tangki_id'        => $this->request->getPost('tangki_id'),
            'nomor_do'         => $this->request->getPost('nomor_do'),
            'volume_do'        => $volume_do,
            'volume_diterima'  => 0, // Default 0, akan diupdate setelah dipping
            'harga_beli'       => $this->request->getPost('harga_beli'),
            'supir'            => $this->request->getPost('supir'),
            'catatan'          => $this->request->getPost('catatan'),
            'status'           => 'pending_dipping'
        ];

        if ($this->penerimaanModel->save($data)) {
---
SELECT *
FROM `tangki`
WHERE `tangki`.`id` = '1'
INSERT INTO `penerimaan` (`tanggal`, `kode_spbu`, `tangki_id`, `nomor_do`, `volume_do`, `volume_diterima`, `harga_beli`, `supir`, `kode_produk`) VALUES ('2025-07-13', 7490123, '1', '111111', 8000, 0, '', '', 'PL')

    public function dipping($id)
    {
        $penerimaan = $this->penerimaanModel->find($id);
---
SELECT *
FROM `penerimaan`
WHERE `penerimaan`.`id` = '3'

    public function processDipping($id)
    {
        $penerimaan = $this->penerimaanModel->find($id);
---
SELECT *
FROM `penerimaan`
WHERE `penerimaan`.`id` = '2'

    public function edit($id)
    {
        $penerimaan = $this->penerimaanModel->find($id);
        if (!$penerimaan || !hasAccessToSPBU($penerimaan['kode_spbu'])) {
            return redirect()->to('/unauthorized');
        }

        $data['penerimaan'] = $penerimaan;
        $data['title'] = 'Edit Penerimaan';
        $data['produkList'] = $this->produkModel->findAll();

        $role = session()->get('role');

        if ($role === 'admin_spbu') {
            $kode_spbu = session()->get('kode_spbu');
            $spbu = $this->spbuModel->where('kode_spbu', $kode_spbu)->first();
            $data['spbuList'] = [$spbu];
            $data['tangkiList'] = $this->tangkiModel->where('kode_spbu', $kode_spbu)->findAll();
        } else {
            $data['spbuList'] = $this->spbuModel->findAll();
            $data['tangkiList'] = $this->tangkiModel->findAll();
---
SELECT *
FROM `penerimaan`
WHERE `penerimaan`.`id` = '2'
SELECT *
FROM `spbu`
WHERE `kode_spbu` = 7490123
 LIMIT 1
SELECT *
FROM `tangki`
WHERE `kode_spbu` = 7490123

    public function update($id)
    {
        $penerimaan = $this->penerimaanModel->find($id);
---
SELECT *
FROM `penerimaan`
WHERE `penerimaan`.`id` = '2'