app/Controllers/Penjualan.php

    public function index()
    {
        $role = session()->get('role');
        $kode_spbu = session()->get('kode_spbu');

        if ($role === 'admin_spbu') {

            $data['penjualan'] = $this->penjualanModel
                ->select('penjualan_harian.*, nozzle.kode_nozzle, produk_bbm.nama_produk, operator.nama_operator')
                ->join('nozzle', 'nozzle.id = penjualan_harian.nozzle_id')
                ->join('produk_bbm', 'produk_bbm.kode_produk = nozzle.kode_produk', 'left')
                ->join('operator', 'operator.id = penjualan_harian.operator_id', 'left')
                ->orderBy('tanggal DESC, shift ASC')
                ->where('penjualan_harian.kode_spbu', $kode_spbu)
                ->findAll();
        } else {
            $data['penjualan'] = $this->penjualanModel
                ->select('penjualan_harian.*, nozzle.kode_nozzle, produk_bbm.nama_produk, operator.nama_operator')
                ->join('nozzle', 'nozzle.id = penjualan_harian.nozzle_id')
                ->join('produk_bbm', 'produk_bbm.kode_produk = nozzle.kode_produk', 'left')
                ->join('operator', 'operator.id = penjualan_harian.operator_id', 'left')
                ->orderBy('tanggal DESC, shift ASC')
                ->findAll();
---
SELECT `penjualan_harian`.*, `nozzle`.`kode_nozzle`, `produk_bbm`.`nama_produk`, `operator`.`nama_operator`
FROM `penjualan_harian`
JOIN `nozzle` ON `nozzle`.`id` = `penjualan_harian`.`nozzle_id`
LEFT JOIN `produk_bbm` ON `produk_bbm`.`kode_produk` = `nozzle`.`kode_produk`
LEFT JOIN `operator` ON `operator`.`id` = `penjualan_harian`.`operator_id`
ORDER BY `tanggal` DESC, `shift` ASC

    public function resetRequests()
    {
        if (!hasAccessToSPBU(session()->get('kode_spbu'))) {
            return redirect()->to('/unauthorized');
        }

        $data['requests'] = $this->resetModel
            ->select('meter_reset_request.*, nozzle.kode_nozzle, produk_bbm.nama_produk, operator.nama_operator')
            ->join('nozzle', 'nozzle.id = meter_reset_request.nozzle_id')
            ->join('produk_bbm', 'produk_bbm.kode_produk = nozzle.kode_produk', 'left')
            ->join('operator', 'operator.id = meter_reset_request.requested_by', 'left')
            ->where('meter_reset_request.kode_spbu', session()->get('kode_spbu'))
            ->orderBy('created_at', 'DESC')
            ->findAll();
---
SELECT `meter_reset_request`.*, `nozzle`.`kode_nozzle`, `produk_bbm`.`nama_produk`, `operator`.`nama_operator`
FROM `meter_reset_request`
JOIN `nozzle` ON `nozzle`.`id` = `meter_reset_request`.`nozzle_id`
LEFT JOIN `produk_bbm` ON `produk_bbm`.`kode_produk` = `nozzle`.`kode_produk`
LEFT JOIN `operator` ON `operator`.`id` = `meter_reset_request`.`requested_by`
WHERE `meter_reset_request`.`kode_spbu` = 0
ORDER BY `created_at` DESC