app/Controllers/Stok.php

SELECT *
FROM `tangki`
WHERE `kode_spbu` = 7490123
---
    public function inputStokReal()
    {
        $kode_spbu = session()->get('kode_spbu');

        $data = [
            'title' => 'Input Stok Real',
            'tangki' => $this->tangkiModel->where('kode_spbu', $kode_spbu)->findAll(),

UPDATE `tangki` SET `stok` = '8000'
WHERE `tangki`.`id` IN ('1')
---

            // Simpan dan update
            $this->stokModel->insert($data);
            $this->tangkiModel->update($tangki_id, ['stok' => $stok_real]);

SELECT `stok_bbm`.*, `tangki`.`kode_tangki`, `produk_bbm`.`nama_produk`
FROM `stok_bbm`
JOIN `tangki` ON `tangki`.`id` = `stok_bbm`.`tangki_id`
JOIN `produk_bbm` ON `produk_bbm`.`kode_produk` = `tangki`.`kode_produk`
WHERE `stok_bbm`.`kode_spbu` = 7490123
AND `stok_bbm`.`tanggal` >= '2025-07-01'
AND `stok_bbm`.`tanggal` <= '2025-07-13'
ORDER BY `stok_bbm`.`tanggal` DESC, `stok_bbm`.`shift` DESC
---
    public function laporan()
    {
        $kode_spbu = session()->get('kode_spbu');
        $startDate = $this->request->getGet('start_date') ?? date('Y-m-01');
        $endDate = $this->request->getGet('end_date') ?? date('Y-m-d');
        $selectedTangki = $this->request->getGet('tangki_id');
        $groupByDay = $this->request->getGet('group_by_day');

        $builder = $this->stokModel
            ->select('stok_bbm.*, tangki.kode_tangki, produk_bbm.nama_produk')
            ->join('tangki', 'tangki.id = stok_bbm.tangki_id')
            ->join('produk_bbm', 'produk_bbm.kode_produk = tangki.kode_produk')
            ->where('stok_bbm.kode_spbu', $kode_spbu)
            ->where('stok_bbm.tanggal >=', $startDate)
            ->where('stok_bbm.tanggal <=', $endDate);

        if ($groupByDay) {
            $builder->where('stok_bbm.is_closing', true);
        }

        if ($selectedTangki) {
            $builder->where('stok_bbm.tangki_id', $selectedTangki);
        }

        $data = [
            'stok' => $builder->orderBy('stok_bbm.tanggal', 'DESC')
                             ->orderBy('stok_bbm.shift', 'DESC')
                             ->findAll(),
            'tangkiList' => $this->tangkiModel->getTangkiBySPBU($kode_spbu),
            'startDate' => $startDate,
            'endDate' => $endDate,
            'selectedTangki' => $selectedTangki,
            'groupByDay' => $groupByDay
        ];

SELECT *
FROM `tangki`
WHERE `kode_spbu` = 7490123
---
    private function _getLastStokPerTangki($kode_spbu)
    {
        $tangki = $this->tangkiModel->where('kode_spbu', $kode_spbu)->findAll();