app/Models/MeterResetRequestModel.php

SELECT `meter_reset_request`.*, `nozzle`.`kode_nozzle`, `produk_bbm`.`nama_produk`, `users`.`username` as `nama_admin_spbu`
FROM `meter_reset_request`
JOIN `nozzle` ON `nozzle`.`id` = `meter_reset_request`.`nozzle_id`
LEFT JOIN `produk_bbm` ON `produk_bbm`.`kode_produk` = `nozzle`.`kode_produk`
JOIN `users` ON `users`.`id` = `meter_reset_request`.`requested_by`
WHERE `meter_reset_request`.`status` = 'pending'
ORDER BY `created_at` DESC
---
    public function getPendingRequests() {
        return $this->select('meter_reset_request.*, nozzle.kode_nozzle, produk_bbm.nama_produk, users.username as nama_admin_spbu')
            ->join('nozzle', 'nozzle.id = meter_reset_request.nozzle_id')
            ->join('produk_bbm', 'produk_bbm.kode_produk = nozzle.kode_produk', 'left')
            ->join('users', 'users.id = meter_reset_request.requested_by')
            ->where('meter_reset_request.status', 'pending')
            ->orderBy('created_at', 'DESC')
            ->findAll();