app/Models/PenerimaanModel.php

SELECT *
FROM `tangki`
WHERE `tangki`.`id` = '1'
---
    protected function setProdukFromTangki(array $data)
    {
        if (isset($data['data']['tangki_id'])) {
            $tangki = $this->tangkiModel->find($data['data']['tangki_id']);

UPDATE `tangki` SET `stok` = stok + 0.00
WHERE `id` = '1'
---
    protected function updateStokTangki($tangkiId, $volume)
    {
        $builder = $this->db->table('tangki');
        $builder->set('stok', 'stok + ' . $volume, false)
               ->where('id', $tangkiId)
               ->update();

SELECT *
FROM `penerimaan`
WHERE `penerimaan`.`id` = 2
---
protected function updateStokAfterInsert(array $data)
{
    $penerimaan = $this->find($data['id']);