app/Models/TangkiModel.php

    public function getTangkiBySPBU($kode_spbu)
    {
    return $this->select('tangki.id, tangki.kode_tangki, produk_bbm.nama_produk')
               ->join('produk_bbm', 'produk_bbm.kode_produk = tangki.kode_produk')
               ->where('kode_spbu', $kode_spbu)
               ->findAll();
---
SELECT `tangki`.`id`, `tangki`.`kode_tangki`, `produk_bbm`.`nama_produk`
FROM `tangki`
JOIN `produk_bbm` ON `produk_bbm`.`kode_produk` = `tangki`.`kode_produk`
WHERE `kode_spbu` = 7490123